zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_LPSPI.h
/*
 * Copyright 1997-2016 Freescale Semiconductor, Inc.
 * Copyright 2016-2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/*!
 * @file S32K566_LPSPI.h
 * @version 2.2
 * @date 2025-10-16
 * @brief Peripheral Access Layer for S32K566_LPSPI
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K566_LPSPI_H_)  /* Check if memory map has not been already included */
#define S32K566_LPSPI_H_

#include "S32K566_COMMON.h"

/* ----------------------------------------------------------------------------
   -- LPSPI Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup LPSPI_Peripheral_Access_Layer LPSPI Peripheral Access Layer
 * @{
 */

/** LPSPI - Size of Registers Arrays */
#define LPSPI_TDBR_COUNT                          128u
#define LPSPI_RDBR_COUNT                          128u

/** LPSPI - Register Layout Typedef */
typedef struct LPSPI_Struct {
  __I  uint32_t VERID;                             /**< Version ID, offset: 0x0 */
  __I  uint32_t PARAM;                             /**< Parameter, offset: 0x4 */
  uint8_t RESERVED_0[8];
  __IO uint32_t CR;                                /**< Control, offset: 0x10 */
  __IO uint32_t SR;                                /**< Status, offset: 0x14 */
  __IO uint32_t IER;                               /**< Interrupt Enable, offset: 0x18 */
  __IO uint32_t DER;                               /**< DMA Enable, offset: 0x1C */
  __IO uint32_t CFGR0;                             /**< Configuration 0, offset: 0x20 */
  __IO uint32_t CFGR1;                             /**< Configuration 1, offset: 0x24 */
  uint8_t RESERVED_1[8];
  __IO uint32_t DMR0;                              /**< Data Match 0, offset: 0x30 */
  __IO uint32_t DMR1;                              /**< Data Match 1, offset: 0x34 */
  uint8_t RESERVED_2[8];
  __IO uint32_t CCR;                               /**< Clock Configuration, offset: 0x40 */
  __IO uint32_t CCR1;                              /**< Clock Configuration 1, offset: 0x44 */
  uint8_t RESERVED_3[16];
  __IO uint32_t FCR;                               /**< FIFO Control, offset: 0x58 */
  __I  uint32_t FSR;                               /**< FIFO Status, offset: 0x5C */
  __IO uint32_t TCR;                               /**< Transmit Command, offset: 0x60 */
  __O  uint32_t TDR;                               /**< Transmit Data, offset: 0x64 */
  uint8_t RESERVED_4[8];
  __I  uint32_t RSR;                               /**< Receive Status, offset: 0x70 */
  __I  uint32_t RDR;                               /**< Receive Data, offset: 0x74 */
  __I  uint32_t RDROR;                             /**< Receive Data Read Only, offset: 0x78 */
  uint8_t RESERVED_5[896];
  __O  uint32_t TCBR;                              /**< Transmit Command Burst, offset: 0x3FC */
  __O  uint32_t TDBR[LPSPI_TDBR_COUNT];            /**< Transmit Data Burst, array offset: 0x400, array step: 0x4 */
  __I  uint32_t RDBR[LPSPI_RDBR_COUNT];            /**< Receive Data Burst, array offset: 0x600, array step: 0x4 */
} LPSPI_Type, *LPSPI_MemMapPtr;

/** Number of instances of the LPSPI module. */
#define LPSPI_INSTANCE_COUNT                     (8u)

/* LPSPI - Peripheral instance base addresses */
/** Peripheral LPE_LPSPI_0 base address */
#define IP_LPE_LPSPI_0_BASE                      (0x4217C000u)
/** Peripheral LPE_LPSPI_0 base pointer */
#define IP_LPE_LPSPI_0                           ((LPSPI_Type *)IP_LPE_LPSPI_0_BASE)
/** Peripheral LPE_LPSPI_1 base address */
#define IP_LPE_LPSPI_1_BASE                      (0x42180000u)
/** Peripheral LPE_LPSPI_1 base pointer */
#define IP_LPE_LPSPI_1                           ((LPSPI_Type *)IP_LPE_LPSPI_1_BASE)
/** Peripheral LPSPI_0 base address */
#define IP_LPSPI_0_BASE                          (0x400D8000u)
/** Peripheral LPSPI_0 base pointer */
#define IP_LPSPI_0                               ((LPSPI_Type *)IP_LPSPI_0_BASE)
/** Peripheral LPSPI_1 base address */
#define IP_LPSPI_1_BASE                          (0x400DC000u)
/** Peripheral LPSPI_1 base pointer */
#define IP_LPSPI_1                               ((LPSPI_Type *)IP_LPSPI_1_BASE)
/** Peripheral LPSPI_2 base address */
#define IP_LPSPI_2_BASE                          (0x402B4000u)
/** Peripheral LPSPI_2 base pointer */
#define IP_LPSPI_2                               ((LPSPI_Type *)IP_LPSPI_2_BASE)
/** Peripheral LPSPI_3 base address */
#define IP_LPSPI_3_BASE                          (0x406C4000u)
/** Peripheral LPSPI_3 base pointer */
#define IP_LPSPI_3                               ((LPSPI_Type *)IP_LPSPI_3_BASE)
/** Peripheral LPSPI_4 base address */
#define IP_LPSPI_4_BASE                          (0x406C8000u)
/** Peripheral LPSPI_4 base pointer */
#define IP_LPSPI_4                               ((LPSPI_Type *)IP_LPSPI_4_BASE)
/** Peripheral LPSPI_5 base address */
#define IP_LPSPI_5_BASE                          (0x408B8000u)
/** Peripheral LPSPI_5 base pointer */
#define IP_LPSPI_5                               ((LPSPI_Type *)IP_LPSPI_5_BASE)
/** Array initializer of LPSPI peripheral base addresses */
#define IP_LPSPI_BASE_ADDRS                      { IP_LPE_LPSPI_0_BASE, IP_LPE_LPSPI_1_BASE, IP_LPSPI_0_BASE, IP_LPSPI_1_BASE, IP_LPSPI_2_BASE, IP_LPSPI_3_BASE, IP_LPSPI_4_BASE, IP_LPSPI_5_BASE }
/** Array initializer of LPSPI peripheral base pointers */
#define IP_LPSPI_BASE_PTRS                       { IP_LPE_LPSPI_0, IP_LPE_LPSPI_1, IP_LPSPI_0, IP_LPSPI_1, IP_LPSPI_2, IP_LPSPI_3, IP_LPSPI_4, IP_LPSPI_5 }

/* ----------------------------------------------------------------------------
   -- LPSPI Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup LPSPI_Register_Masks LPSPI Register Masks
 * @{
 */

